Revit 2026 API

# ConduitSizes Class

---

Class ConduitSizeSet being used to store the conduit sizes.

SystemObject Autodesk.Revit.DB.ElectricalConduitSizes

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ConduitSizes : IEnumerable<ConduitSize>,
	IDisposable
```
```vb
Public Class ConduitSizes
	Implements IEnumerable(Of ConduitSize), IDisposable
```
```cpp
public ref class ConduitSizes : IEnumerable<ConduitSize^>,
	IDisposable
```
```fsharp
type ConduitSizes =
    class
        interface IEnumerable<ConduitSize>
        interface IDisposable
    end
```

The ConduitSizes type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Count | Count of the items contained in the collection. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Contains | Checks whether a conduit size with the nominal diameter exists. |
|  | Dispose | Releases all resources used by the ConduitSizes |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetBasicIEnumerator | Returns an enumerator that iterates through a collection. |
|  | GetConduitSizesIterator | Returns a ConduitSizeIterator to the conduit sizes. |
|  | GetEnumerator | Returns an enumerator that iterates through a collection. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Electrical Namespace